<?php $this->title = "ГУД | Правила пользования";?>
<a class="anchor" href="#top">Наверх ↑</a>
<h2><a class="guide-heading" name="top">Правила пользования</a></h2>
<h3>Оглавление</h3>
<div class="contents" id="guide">
	<ol>
        <li><a class = "guide-options" href="#registration-on-system">Регистрация в Системе</a></li>
 		<li><a class = "guide-options" href="#authorization-on-system">Авторизация в Системе</a></li>
        <li><a class = "guide-options" href="#main-menu-review">Обзор главного меню</a>
           <ol>
                <li><a class = "guide-options" href="#main-menu-review#contact">Контакты или как связаться с разработчиком</a></li>
                <li><a class = "guide-options" href="#main-menu-review#log">Журнал событий пользователя</a></li>
                <li><a class = "guide-options" href="#main-menu-review#slide-menu">Всплывающее меню</a></li>     
            </ol>
        </li>
        <li><a class = "guide-options" href="#examination">Экзаменация</a>
        	<ol>
        		<li> <a class = "guide-options" href="#examination#demo">Демонстрационные примеры</a></li>
        		<li> <a class = "guide-options" href="#examination#test">Прохождение тестирования</a></li>
        		<li> <a class = "guide-options" href="#examination#practice">Прохождение практики</a></li>
        		<li> <a class = "guide-options" href="#examination#exam">Проверочная работа</a></li>
        	</ol>
        </li>
        <li><a class = "guide-options" href="#statistics">Статистика</a>
        	<ol>
        		<a class = "guide-options" href="#statistics#all">Общая статистика</a>
        		<a class = "guide-options" href="#statistics#one">Статистика работы</a>
        	</ol>
        </li>
        <li><a class = "guide-options" href="#profile">Профиль</a></li>
        
    </ol>
</div>

<div>
	<div class="text-block">
		<h3><a class="heading" name="registration-on-system">1. Регистрация в Системе</a></h3>
		<p class="text"> Для того, чтобы зарегистрироваться в Системе, на экране авторизации нажмите на гиперссылку <b>"Еще не зарегистрированы на сайте?"</b> (см. Рис. 1.1).</p>
		<img class="img-for-text" src="/img/2pSN-wADCO8.jpg">
		<p class="text-for-img">Рис.1.1 Переход на страницу регистрации</p>
		<p class="text">	Далее произойдет переход на страницу регистрации. Следуя указаниям графического интерфейса Системы, введите фамилию, имя, отчество, из раскрывающихся списков выберете соответствующие факультет, кафедру и номер группы, в которой Вы на данный момент учитесь. </p>
		<p class="text">	В случае возникновения проблем с заполнением вышеупомяннутых данных рекомендуем обратиться к старосте группы или в учебную часть Вашего факультета. </p>
		<img class="img-for-text" src="/img/J0h_yn66xss.jpg">
		<p class="text-for-img">Рис.1.2 Страница регистрации</p>
		<p class="text">	После введения данных нажмите на кнопку <b>"Регистрация"</b>. В случае отмены регистрации или возврата на страницу авторизации, нажмите на кнопку <b>"Назад"</b>.</p>
		<img class="img-for-text" src="/img/J0h_yn66xcc.jpg">
		<p class="text-for-img">Рис.1.3 Страница регистрации с введенными данными</p>
		<p class="text">	После выполненных действий произойдет проверка введенных Вами данных на наличие аналогичного пользователя в Системе. В случае успешной проверки сведений произойдет переход на страницу вывода авторизационных данных, которые необходимо будет использовать при последующей авторизации в Системе. </p>
		<img class="img-for-text" src="/img/K_yj0Kpr66.jpg">
		<p class="text-for-img">Рис.1.4 Страница успешной регистрации с авторизационными данными</p>
		<p class="text">	Настоятельная рекомендация запомнить выданный Системой логин и пароль, так как, в случае их утери, восстановление этих данных невозможно! </p>
		<p class="text">	Для дальнейшей авторизации в личный кабинет нажмите на кнопку <b>"Войти в Систему"</b>. </p>
		<img class="img-for-text" src="/img/K_yj0Kpr77.jpg">
		<p class="text-for-img">Рис.1.5 Кнопка "Войти в Систему"</p>
		<p class="text">	Этап регистрации завершен. </p>
	</div>
	<div class="text-block">
		<h3><a class="heading" name="authorization-on-system">2. Авторизация в Системе</a></h3>
		<p class="text"> Для того, чтобы авторизироватсья в Системе, перейдите на главную страницу сайта (по адресу <i>gud.trainer.ru</i>) или перейдите с помощью пункта верхнего горизонтального меню <b>"Авторизация"</b> (см. Рис. 2.1).</p>
		<img class="img-for-text" src="/img/2pSN-w.jpg">
		<p class="text-for-img" id="text-for-img-auth">Рис.2.1 Страница авторизации</p>
		<p class="text"> Введите соответствующие авторизационные данные в поля <b>Логин</b> и <b>Пароль</b>, которые были получены на этапе регистрации. Нажмите на кнопку "Войти".</p>
		<img class="img-for-text" src="/img/K_yj0.jpg">
		<p class="text-for-img">Рис.2.2 Страница авторизации с введенными данными</p>
		<p class="text"> После выполненных действий произойдет проверка введенных Вами данных на корректность ввода логина и пароля. В случае успешной проверки сведений, произойдет переход в личный кабинет студента.</p>
		<img class="img-for-text" src="/img/2pSN-wARGH4.jpg">
		<p class="text-for-img">Рис.2.3 Главное меню студента</p>
		<p class="text"> Этап авторизации завершен.</p>
	</div>

	<div class="text-block">
		<h3><a class="heading" name="main-menu-review">3. Обзор главного меню</a></h3>

		<p class="text"> Главное меню студента представляет собой верхнее горизонтальное меню с пунктами <b>Главная</b>, <b>Связаться с разработчиком</b>, <b>Журнал событий</b>, <b>Правила пользования</b> и выпадающее меню личного профиля студента <b>Добро пожаловать ИМЯ ОТЧЕСТВО</b>, а, также, в заголовке главного меню в указано название направления и номер группы авторизовавшегося студента.</p>
		<p class="text"> В центральной области главного меню представлены два окна с выбором, соответственно, типа экзаменовок и темы экзаменовок определенного предмета. </p>
		<img class="img-for-text" src="/img/2pSN-wARGH4.jpg">
		<p class="text-for-img">Рис.3.1 Главное меню студента</p>
		<p class="text"> В разделе типов экзаменовок представленны следующие варианты выбора:</p>
			<p class="second-text">
				<b>Демо примеры</b> - демонстрационный материал, специально подготовленный преподавателем как один из вариантов ведения лекций или семинаров. Представляет из себя комбинацию текста с соответствующими изображениями; не имеет вариантов ответа.  Демо пример не считается как отдельный вид экзаменовкии и его прохождение не отражается в личной статистике студента.
			</p>
			<p class="second-text">
				<b>Тестирование</b> - один из видов экзаменовок, предназначенный для проверки теоретических знаний студентов. Представляет из себя вопросы с выбором одного или нескольких вариантов ответов из предложенных. 
			</p>
			<p class="second-text">
				<b>Практика</b> - один из видов экзаменовок, предназначенный для проверки практических умений студентов. Представляет из себя вопросы, ответы на которые вводятся в специальные поля с клавиатуры. 
			</p>
			<p class="second-text">
				<b>Проверочная работа</b> - контрольный вид экзаменовки, представляющий из себя комбинацию теоретических и практических вопросов и ограниченный по времени 20 (двадцать) минут.
			</p>

		<h4><a class="second-heading" name="main-menu-review#contact">3.1. Контакты или как связаться с разработчиком</a></h4>
		<p class="second-text"> Для того, чтобы найти контакты разработчика и связаться с ним в случае вопросов, связанных с работоспособностью сервиса, нажмите в верхнем горизонтальном меню на пункт <b>Связаться с разработчиком</b>.</p>

		<img class="img-for-text" src="/img/DDK_yj0Kpr66.jpg">
		<p class="text-for-img">Рис.3.2 Окно контактов разработчика</p>

		<h4><a class="second-heading" name="main-menu-review#log">3.2. Журнал событий пользователя</a></h4>
		<p class="second-text"> Журнал событий пользователя содержит информацию о событиях, произошедших в его личном кабинете, таких как комментирование преподавателем тестов, проверка тестов преподавателем и др. Запись в журнале представляет из себя порядковый номер записи, описание события, дата события и список действий с записью.</p>
		<img class="img-for-text" src="/img/H_yj0KpККrud4.jpg">
		<p class="text-for-img">Рис.3.3 Окно журнала событий</p>

		<p class="second-text"> Пользователю предоставлены возможности <b>отмечать</b> запись в журнале, как прочитанную и <b>удалять</b> запись, а также <b>отметить все</b> записи, как прочитанные.</p>
		<p class="second-text"> Для того, чтобы отметить одну запись в журнале, в списке действий записи раздела <b>Новые</b> нажмите на гиперссылку <b>Отметить</b></p>
		<img class="img-for-text" src="/img/pfh_6489_check.jpg">
		<p class="text-for-img">Рис.3.4 Выбор действия записи: отметить</p>
		<p class="second-text"> После выполненных действий запись перейдет в раздел журнала <b>Просмотренные</b>.</p>
		<img class="img-for-text" src="/img/2pSSsN-w.jpg">
		<p class="text-for-img">Рис.3.5 Отмеченная запись перешла в раздел "Просмотренные"</p>
		<p class="second-text"> Для того, чтобы отметить все новые записи, нажмите на кнопку <b>Отметить все</b>.</p>
		<img class="img-for-text" src="/img/pfh_648910.jpg">
		<p class="text-for-img">Рис.3.6 Выбор действия записи: отметить все</p>
		<p class="second-text"> После выполненных действий все новые записи перейдут в раздел журнала <b>Просмотренные</b>.</p>
		<img class="img-for-text" src="/img/DRDK_yj0Kpr66.jpg">
		<p class="text-for-img">Рис.3.7 Отмеченные записи перешли в раздел "Просмотренные"</p>
		<p class="second-text"> Для того, чтобы удалить запись в журнале, в списке действий записи раздела <b>Новые</b> или <b>Просмотренные</b> нажмите на гиперссылку <b>Удалить</b></p>
		<img class="img-for-text" src="/img/ggf-098235.jpg">
		<p class="text-for-img">Рис.3.8 Выбор действия записи: удалить</p>
		<p class="second-text"> После выполненных действий запись будет удалена из журнала.</p>
		<img class="img-for-text" src="/img/DDK_r66.jpg">
		<p class="text-for-img">Рис.3.9 Результат удаления записи</p>
		<p class="second-text"> Для того, чтобы вернуться обратно в главное меню, нажмите на кнопку <b>Назад</b></p>
		<img class="img-for-text" src="/img/132DDK_r66.jpg">
		<p class="text-for-img">Рис.3.10 Кнопка <b>Назад</b> в главное меню</p>

		<h4><a class="second-heading" name="main-menu-review#slide-menu">3.3. Всплывающее меню</a></h4>
		<p class="second-text"> Всплывающее меню представляет из себя список соответствующих пунктов, касающихся конкретного авторизованного пользователя, а именно <b>Статистика</b>, <b>Профиль</b>, а также пункт <b>Выйти</b> из аккаунта. Чтобы открыть это меню, в верхнем горизонтальном меню в пункте <b>Добро пожаловать ИМЯ ОТЧЕСТВО</b> справа нажмите на знак <b>▼</b>.</p>
		<img class="img-for-text" src="/img/tt6.jpg">
		<p class="text-for-img">Рис.3.11 Всплывающее меню</p>
		<p class="second-text"> Чтобы закрыть меню, повторно нажмите на знак <b>▼</b>.</p>

	</div>

	<div class="text-block">
		<h3><a class="heading" name="examination">4. Экзаменация</a></h3>
		<p class="text"> Экзаменация - прохождение в сервисе одного из представленных типов экзаменовок: тестирования, практики или проверочной работы. При прохождении экзаменации каждому варианту генерируется уникальный номер вида <b>A123-a-b-c-dd-mm-yy-xxxxxx</b>, где: </p>
			<p class="second-text"> <b>A</b> - первая буква типа экзаменовки: T - тестирование, P - практика, E - проверочная работа</p> <br>
			<p class="second-text"> <b>123</b> - порядковый номер записи экзаменовки в базе данных</p><br>
			<p class="second-text"> <b>a</b> - идентификатор типа экзаменовки </p><br>
			<p class="second-text"> <b>b</b> - идентификатор предмета</p><br>
			<p class="second-text"> <b>c</b> - идентификатор темы предмета</p><br>
			<p class="second-text"> <b>dd</b> - день экзаменовки </p><br>
			<p class="second-text"> <b>mm</b> - месяц экзаменовки</p><br>
			<p class="second-text"> <b>yy</b> - последние две цифры года экзаменовки</p><br>
			<p class="second-text"> <b>xxxxxx</b> - случайно сгенерированные числа</p><br>

		<p class="text"> При просмотре демо примеров номер варианта не генерируется. Результат теста сохраняется в личной статистике пользователя и отражается в его личном профиле. </p>		

			<h4><a class="second-heading" name="examination#demo">4.1. Демонстрационные примеры</a></h4>
			<p class="second-text"> Для просмотра демонстрационных примеров в главном меню в разделе <b>Выберите тип экзаменовки</b> выберите пункт <b>Демо примеры</b>, далее в разделе <b>Выберите предмет</b> найдите необходимый предмет, раскройте список тем предмета, нажав на знак <b>▼</b> справа от названия предмета, далее выберите из раскрывшегося списка соответствующую тему. После проделанных действий нажмите на кнопку <b>Приступить</b>.</p>	
			<img class="img-for-text" src="/img/2p25sN-w.jpg">
			<p class="text-for-img">Рис.4.1 Вариант выбора темы и предмета демо примера</p>
			<p class="second-text"> В открывшемся окне демонстрационных примеров Вам будут доступны все материалы, которые подготовил преподаватель по этой теме соответствующего предмета.</p>
			<img class="img-for-text" src="/img/DREdfpr66.jpg">
			<p class="text-for-img">Рис.4.2 Вариант демо-примера</p>
			<p class="second-text"> Для завершения демонстрации нажмите в самом низу на кнопку <b>Назад</b>.</p>

			<h4><a class="second-heading" name="examination#test">4.2. Прохождение тестирования</a></h4>

			<p class="second-text"> Для прохождения тестирования в главном меню в разделе <b>Выберите тип экзаменовки</b> выберите пункт <b>Тестирование</b>, далее в разделе <b>Выберите предмет</b> найдите необходимый предмет, раскройте список тем предмета, нажав на знак <b>▼</b> справа от названия предмета, далее выберите из раскрывшегося списка соответствующую тему. После проделанных действий нажмите на кнопку <b>Приступить</b>.</p>
			<img class="img-for-text" src="/img/0012SSsN-w.jpg">
			<p class="text-for-img">Рис.4.3 Вариант выбора темы и предмета тестирования</p>
			<p class="second-text">Прочитайте вопросы и выберете соответствующие варианта ответа из представленных. После выбора ответов нажмите на кнопку <b>Завершить</b>. </p>
			<img class="img-for-text" src="/img/orsDsK_r66.jpg">
			<p class="text-for-img">Рис.4.4 Пример тестирования</p>
			<p class="second-text">После выполненных действий появится сообщение, уведомляющее, что экзаменация завершена. Этап прохождения тестирования завершен. </p>
			<img class="img-for-text" src="/img/RsN-wr.jpg">
			<p class="text-for-img">Рис.4.5 Пример завершения тестирования</p>

			<h4><a class="second-heading" name="examination#practice">4.3. Прохождение практики</a></h4>

			<p class="second-text"> Для прохождения практики в главном меню в разделе <b>Выберите тип экзаменовки</b> выберите пункт <b>Практика</b>, далее в разделе <b>Выберите предмет</b> найдите необходимый предмет, раскройте список тем предмета, нажав на знак <b>▼</b> справа от названия предмета, далее выберите из раскрывшегося списка соответствующую тему. После проделанных действий нажмите на кнопку <b>Приступить</b>.</p>
			<img class="img-for-text" src="/img/77sN77-w.jpg">
			<p class="text-for-img">Рис.4.6 Вариант выбора темы и предмета практики</p>
			<p class="second-text">Прочитайте вопросы и введите соответствующие варианты ответа с клавиатуры. После ввода ответов нажмите на кнопку <b>Завершить</b>. </p>
			<img class="img-for-text" src="/img/DDK12etr66.jpg">
			<p class="text-for-img">Рис.4.7 Пример практики</p>
			<p class="second-text">После выполненных действий появится сообщение, уведомляющее, что экзаменация завершена. Этап прохождения практики завершен. </p>
			<img class="img-for-text" src="/img/D234r66.jpg">
			<p class="text-for-img">Рис.4.8 Пример завершения практики</p>

			<h4><a class="second-heading" name="examination#exam">4.4. Проверочная работа</a></h4>

			<p class="second-text"> Для прохождения проверочной работы в главном меню в разделе <b>Выберите тип экзаменовки</b> выберите пункт <b>Проверочная работа</b>, далее в разделе <b>Выберите предмет</b> найдите необходимый предмет, раскройте список тем предмета, нажав на знак <b>▼</b> справа от названия предмета, далее выберите из раскрывшегося списка соответствующую тему. После проделанных действий нажмите на кнопку <b>Приступить</b>.</p>
			<img class="img-for-text" src="/img/D123234r66.jpg">
			<p class="text-for-img">Рис.4.9 Вариант выбора темы и предмета проверочной работы</p>
			<p class="second-text">Прочитайте вопросы и выберете соответствующие варианта ответа из представленных. После выбора ответов нажмите на кнопку <b>Завершить</b>. </p>
			<img class="img-for-text" src="/img/2231pSSsN-w.jpg">
			<p class="text-for-img">Рис.4.10 Пример проверочной работы</p>
			<p class="second-text">После выполненных действий появится сообщение, уведомляющее, что экзаменация завершена. Этап прохождения проверочной работы завершен. </p>
			<img class="img-for-text" src="/img/wqerw_234t.jpg">
			<p class="text-for-img">Рис.4.11 Пример завершения проверочной работы</p>
	</div>

	<div class="text-block">
		<h3><a class="heading" name="statistics">5. Статистика</a></h3>
		<p class="text"> Студенту результаты всех своих тестов доступны в разделе <b>Статистика</b> во всплывающем меню верхнего горизонтального меню. Пользователь может посмотреть все свои пройденные тесты, а также посмотреть подробнее результаты конкретного решенного теста.  </p>

			<h4><a class="second-heading" name="statistics#all">5.1. Общая статистика</a></h4>
			<p class="second-text"> Для того, чтобы перейти в раздел общей статистики решенных тестов, в верхнем меню навигации нажмите на всплывающее меню, далее <b>Статистика</b>.</p>
			<img class="img-for-text" src="/img/dsfrDS6.jpg">
			<p class="text-for-img">Рис.5.1 Пункт меню <b>Статистика</b></p>
			<p class="second-text"> Отображается окно статистики студента. Разделы статистики состоят из следущих пунктов: номер варианта пройденной работы, дата прохождения, оценка и список действий. Цвета, выделяющие запись о результате работы, соответствуют выставленной оценке: красный - неудовлетворительно, оранжевый - удовлетворительно, желтый - хорошо, зеленый - отлично. Для того, чтобы вернуться в главное меню, нажмите на кнопку <b>Назад</b></p>
			<img class="img-for-text" src="/img/HHweq97-w.jpg">
			<p class="text-for-img">Рис.5.2 Общая статистика</p>

			<h4><a class="second-heading" name="statistics#all">5.2. Частная статистика</a></h4>
			<p class="second-text"> Для того, чтобы перейти в раздел частной статистики решенного теста, в разделе общей статистики нажмите на гиперссылку <b>Посмотреть</b> в соответствующей записи результата работы.</p>
			<img class="img-for-text" src="/img/HHwe111q97-w.jpg">
			<p class="text-for-img">Рис.5.3 Выбор частной статистики пройденной работы</p>
			<p class="second-text"> Отображается окно результата конкретной работы, состоящего из трех логических блоков: блок статистики теста (общая информация), блок результатов теста, блока комментариев преподавателя.
			</p>
			<img class="img-for-text" src="/img/77sNnm77-w.jpg">
			<p class="text-for-img">Рис.5.4 Пример частной статистики</p>
	</div>
</div>