<?php $this->title = "ГУД | Помощь";?>
<a class="anchor" href="#top">Наверх ↑</a>
<h2><a class="guide-heading" name="top">Помощь</a></h2>
<h3>Оглавление</h3>

<div class = "contents">
	<ol>
		<li><a class = "guide-options" href="#registration-on-system">Правила регистрации</a></li>
		<li><a class = "guide-options" href="#authorization-on-system">Правила авторизации</a></li>
		<li> <a class = "guide-options" href="#registration-problem">Проблемы с регистрацией</a>
			<ol>
				<li><a class = "guide-options" href="#registration-problem#error1">Появляется ошибка, что пользователь существует, хотя я регистрируюсь в первый раз</a></li>
				<li><a class = "guide-options" href="#registration-problem#error2">При выборе из выпадающего списка факультета / направления / номера группы отсутствует нужный мне пункт</a></li>
			</ol>
		</li>
		<li><a class = "guide-options" href="#authorization-problem">Проблемы с авторизацией</a>
			<ol>
				<li><a class = "guide-options" href="#authorization-problem#error1">Утерян логин / пароль</a></li>
				<li><a class = "guide-options" href="#authorization-problem#error2">Ввожу корректные логин и пароль, а программа выдает ошибку, что данные неверны</a></li>
				<li><a class = "guide-options" href="#authorization-problem#error3">Ввожу свои данные, а авторизируюсь в чужой личный кабинет</a></li>
			</ol>
		</li>
		<li><a class = "guide-options" href="#admin">Контакты администратора</a></li>
		<li><a class = "guide-options" href="#dev">Контакты разработчика</a></li>
	</ol>
</div>

<div class="text-block">
	<h3><a class="heading" name="registration-on-system">1. Правила регистрации</a></h3>
	<p class="text"> Для того, чтобы зарегистрироваться в Системе, на экране авторизации нажмите на гиперссылку <b>"Еще не зарегистрированы на сайте?"</b> (см. Рис. 1.1).</p>
	<img class="img-for-text" src="/img/2pSN-wADCO8.jpg">
	<p class="text-for-img">Рис.1.1 Переход на страницу регистрации</p>
	<p class="text">	Далее произойдет переход на страницу регистрации. Следуя указаниям графического интерфейса Системы, введите фамилию, имя, отчество, из раскрывающихся списков выберете соответствующие факультет, кафедру и номер группы, в которой Вы на данный момент учитесь. </p>
	<p class="text">	В случае возникновения проблем с заполнением вышеупомяннутых данных рекомендуем обратиться к старосте группы или в учебную часть Вашего факультета. </p>
	<img class="img-for-text" src="/img/J0h_yn66xss.jpg">
	<p class="text-for-img">Рис.1.2 Страница регистрации</p>
	<p class="text">	После введения данных нажмите на кнопку <b>"Регистрация"</b>. В случае отмены регистрации или возврата на страницу авторизации, нажмите на кнопку <b>"Назад"</b>.</p>
	<img class="img-for-text" src="/img/J0h_yn66xcc.jpg">
	<p class="text-for-img">Рис.1.3 Страница регистрации с введенными данными</p>
	<p class="text">	После выполненных действий произойдет проверка введенных Вами данных на наличие аналогичного пользователя в Системе. В случае успешной проверки сведений произойдет переход на страницу вывода авторизационных данных, которые необходимо будет использовать при последующей авторизации в Системе. </p>
	<img class="img-for-text" src="/img/K_yj0Kpr66.jpg">
	<p class="text-for-img">Рис.1.4 Страница успешной регистрации с авторизационными данными</p>
	<p class="text">	Настоятельная рекомендация запомнить выданный Системой логин и пароль, так как, в случае их утери, восстановление этих данных невозможно! </p>
	<p class="text">	Для дальнейшей авторизации в личный кабинет нажмите на кнопку <b>"Войти в Систему"</b>. </p>
	<img class="img-for-text" src="/img/K_yj0Kpr77.jpg">
	<p class="text-for-img">Рис.1.5 Кнопка "Войти в Систему"</p>
	<p class="text">	Этап регистрации завершен. </p>
</div>

<div class="text-block">
	<h3><a class="heading" name="authorization-on-system">2. Правила авторизации</a></h3>
	<p class="text"> Для того, чтобы авторизироватсья в Системе, перейдите на главную страницу сайта (по адресу <i>gud.trainer.ru</i>) или перейдите с помощью пункта верхнего горизонтального меню <b>"Авторизация"</b> (см. Рис. 2.1).</p>
	<img class="img-for-text" src="/img/2pSN-w.jpg">
	<p class="text-for-img" id="text-for-img-auth">Рис.2.1 Страница авторизации</p>
	<p class="text"> Введите соответствующие авторизационные данные в поля <b>Логин</b> и <b>Пароль</b>, которые были получены на этапе регистрации. Нажмите на кнопку "Войти".</p>
	<img class="img-for-text" src="/img/K_yj0.jpg">
	<p class="text-for-img">Рис.2.2 Страница авторизации с введенными данными</p>
	<p class="text"> После выполненных действий произойдет проверка введенных Вами данных на корректность ввода логина и пароля. В случае успешной проверки сведений, произойдет переход в личный кабинет студента.</p>
	<img class="img-for-text" src="/img/2pSN-wARGH4.jpg">
	<p class="text-for-img">Рис.2.3 Главное меню студента</p>
	<p class="text"> Этап авторизации завершен.</p>
</div>

<div class="text-block">

	<h3><a class="heading" name="registration-problem">3. Проблемы с регистрацией</a></h3>
	<p class="text"> Уведомляем Вас, что на данный момент не было зарегистрировано ни одной ошибки с регистрацией, так как Система только перешла режим опытной эксплуатации. В случае возникновения каких либо ошибок с регистрацией, просим Вас незамедлительно связаться с администратором или разработчиком. </p>

		<h4><a class="second-heading" name="registration-problem#error1">3.1. Появляется ошибка, что пользователь существует, хотя я регистрируюсь в первый раз</a></h4>
		<p class="second-text"> При регистрации в Системе происходит проверка на наличие аналогичного пользователя в базе данных по сочетанию полей <b>ФАМИЛИЯ+ИМЯ+ОТЧЕСТВО</b>. В случае возникновения ситуации, что другой пользователь с аналогичным ФИО зарегистрировался ранее, то обратитесь к <a href="#admin">администратору</a> сервиса для получения логина и пароля. Если будет поступать большое количество подобных заявок, то администратором сервиса будет сгенерирована задача разаботчику на снятие этого ограничения.</p>

		<h4><a class="second-heading" name="registration-problem#error2">3.2. При выборе из выпадающего списка факультета / направления / номера группы отсутствует нужный мне пункт</a></h4>
		<p class="second-text"> Обращаем Ваше внимание, что сервис находится в стадии опытной эксплуатации и не все данные об учебной инфраструктуре университета были заполнены. Поставщиком информации о факультетах, направлениях, кафедрах и группах, в настоящий момент, является портал университета "Дубна" (находящийся по адресу <i>https://new.uni-dubna.ru</i>). В случае, если какой либо параметр не был добавлен, просим Вас обратиться к <a href="#admin">администратору</a> сервиса с подробным описанием проблемы.</p>
</div>

<div class="text-block">
	<h3><a class="heading" name="authorization-problem">4. Проблемы с авторизацией</a></h3>
	<p class="text"> Уведомляем Вас, что на данный момент не было зарегистрировано ни одной ошибки с авторизацией, так как Система только перешла режим опытной эксплуатации. В случае возникновения каких либо ошибок с регистрацией, просим Вас незамедлительно связаться с администратором или разработчиком. </p>

		<h4><a class="second-heading" name="authorization-problem#error1">4.1. Утерян логин / пароль</a></h4>
		<p class="second-text"> Сообщаем, что <a href="#admin">администратору</a> предоставлены права по восстановлению логина и пароля пользователей. В случае утери логина или пароля напишите администратору на почту письмо с заголовком <b>Команда восстановления логина / пароля / всего </b> с следуюшим содержанием:</p>
		<div class="letter">
			<p><i><b>Фамилия Имя Отчество</b>, группа №<b>1234</b> направления <b>Название</b> факультета <b>Название</b></i></p>
			<p><i>Известно: логин / пароль / ничего</i></p>
			<p><i>Прошу восстановить: логин / пароль / все</i></p>
		</div>
		<p class="second-text"> Авторизационные данные будут высланы на почту обратившегося пользователя.</p>

		<h4><a class="second-heading" name="authorization-problem#error2">4.2. Ввожу корректные логин и пароль, а программа выдает ошибку, что данные неверны</a></h4>
		<p class="second-text"> В данном случае просим Вас еще раз удостовериться в корректности введенных данных, возможно, Вы включили русскую раскладку клавиатуры или нажали клавишу CAPS LOCK при вводе пароля. Напоминаем, что логин и пароль вводятся по следующим шаблонам соответсвтенно: <b>#ABC.12</b> и <b>@abc.123</b>. В случае, если вышеописанные рекомендации не помогли, то советуем Вам поменять логин и пароль (инструкцию по смене логина и пароля смотрите в пункте <a href="#authorization-problem#error1">4.1</a>) </p>

		<h4><a class="second-heading" name="authorization-problem#error3">4.3. Ввожу свои данные, а авторизируюсь в чужой личный кабинет</a></h4>
		<p class="second-text"> Подобный вариант развития событий с 0.00000012% долей вероятности мог произойти при генерации логина и пароля пользователя. В таком случае просим Вас незамедлительно связаться с <a href="#dev">разработчиком</a> с подробным описанием проблемы, предоставив логин и пароль, под которым Вы авторизуетесь, а также указать ФИО пользователя, в чей личный кабинет Вы попадаете. </p>
</div>

<div class="text-block">
	<h3><a class="heading" name="admin">5. Контакты администратора</a></h3>
	<p class="text"> <b>ФИО: </b> Урядышев Павел Александрович</p>
	<p class="text"> <b>WhatsApp: </b>8 (916) 571-00-27</p>
	<p class="text"> <b>Электронная почта: </b> pavel111pavel@yandex.ru</p>
</div>

<div class="text-block">
	<h3><a class="heading" name="dev">6. Контакты разработчика</a></h3>
	<p class="text"> <b>ФИО: </b> Урядышев Павел Александрович</p>
	<p class="text"> <b>WhatsApp: </b>8 (916) 571-00-27</p>
	<p class="text"> <b>Электронная почта: </b> pavel111pavel@yandex.ru</p>
</div>